import os
import sqlalchemy as sa  # <--- ОСЬ ЦЬОГО НЕ ВИСТАЧАЛО
from app import app, db
from flask_migrate import upgrade

# Цей блок автоматично запустить 'flask db upgrade' при старті на сервері
with app.app_context():
    # Якщо ми в інтернеті (на Render), запускаємо логіку
    if os.environ.get('RENDER'):
        print("Запуск міграції бази даних...")
        upgrade()
        print("Міграція завершена!")

        # Тимчасовий код для створення адміна
        from app.models import User
        
        # Шукаємо користувача
        print("Шукаємо Максима...")
        user = db.session.scalar(sa.select(User).where(User.name == 'Максим Глущенко'))
        
        if user:
            user.role = 'admin'
            db.session.commit()
            print("УРА! Максим тепер Адмін! 🦸‍♂️")
        else:
            print("Хмм, користувача 'Максим Глущенко' не знайдено. Може помилка в імені?")

if __name__ == '__main__':
    app.run()